Revit 2024 API
WaterLoopData Members
The WaterLoopData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the WaterLoopData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ChillerType
 The type of water chiller. Note this property change would reset the condenser water loop.
CondenserWaterLoopId
 The water loop element id for the water cooled chiller.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
WaterLoopType
 The type of water loop. Note this property change would reset other properties.
See Also
WaterLoopData Class
Autodesk.Revit.DB.Mechanical Namespace